** Build

	 To build TEMmy, simply execute the following block. It will create a directory called temmy which you can upload wherever you want to host TEMmy.

	 #+begin_src emacs-lisp
		 ;; Make sure there is no existing TEMmy build
		 (shell-command "if [ -d temmy ]; then rm -rf temmy; fi")
		 ;; Generate the Ink file
		 (org-babel-tangle)
		 ;; Compile the ink file
		 (shell-command "mono inklecate/inklecate.exe temmy.ink")

		 ;; Make the static site
		 (shell-command "cp -r boilerplate temmy")
		 (let ((storyjs
						(concat "var storyContent = "
										(with-temp-buffer (insert-file-contents "temmy.ink.json") (buffer-string))
										";")))
			 (save-excursion (find-file "temmy/story.js")
											 (insert storyjs)
											 (save-buffer)))
		 (copy-file "index.html" "temmy/")
		 (copy-directory "images" "temmy/")
		 (rename-file "temmy.js" "temmy/")
		 
		 ;; Clean up
		 (shell-command "rm temmy.ink")
		 (shell-command "rm temmy.ink.json")
		 ;; Share with Windows partition
		 (shell-command "sudo cp -r temmy /mnt/arch-share/")
	 #+end_src

	 #+RESULTS:
	 : 0


	 
	 
	 
	 
	 

